Revit 2027 API
SolidUtils.SplitVolumes Method
 Splits a solid geometry into several separate solids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Solid> SplitVolumes(
	Solid solid
)
Public Shared Function SplitVolumes (
	solid As Solid
) As IList(Of Solid)
public:
static IList<Solid^>^ SplitVolumes(
	Solid^ solid
)
static member SplitVolumes :
        solid : Solid -> IList<Solid>
Parameters
solid Solid
 The solid.
Return Value
IList<Solid>
 The split solid geometries.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to split the solid geometry.
Remarks
 If no splitting is done, a copy of the input solid will be returned in the output array.
See Also
Reference
SolidUtils Class
Autodesk.Revit.DB Namespace